In [1]:
name = "Cobee"
name

'Cobee'

In [2]:
number = 4
number

4

# Machine Learning
There are 7 steps in machine learning :
- Collecting data
- Preparing data
- Choose a Model
- Training the Model
- Evaluating the Model
- Parameter Tuning
- Making predictions

In [5]:
import pandas as pd #Import Pandas with alias pd
data = [1,2,3]
# df = pd.DataFrame(data) #Converting a list to a dataframe #0 is column names
# df = pd.DataFrame(data, columns=['Numbers'])
df = pd.DataFrame(data, columns=['Numbers'], index=['a', 'b', 'c'])
df

   Numbers
a        1
b        2
c        3

In [6]:
student = [['Tom', 90], ['Jack', 80], ['Jill', 70]] #Create a 2D list for 2 Columns
data_student = pd.DataFrame(student, columns=['Name', 'Grade']) #'Name' , 'Grade' Is Column header
data_student

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [7]:
data_student['Name']

0     Tom
1    Jack
2    Jill
Name: Name, dtype: object

In [9]:
new_student = [['Sam', 60], ['Mary', 50], ['John', 40], ['Joseph', 30]]
new_student = pd.DataFrame(new_student, columns=['Name', 'Grade'])
data_student = pd.concat([data_student, new_student], ignore_index=True)#combine 2 dataframes 
data_student 

#concatenate, menyatukan

      Name  Grade
0      Tom     90
1     Jack     80
2     Jill     70
3      Sam     60
4     Mary     50
5     John     40
6   Joseph     30
7      Sam     60
8     Mary     50
9     John     40
10  Joseph     30

In [11]:
data_student.head(5)

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70
3   Sam     60
4  Mary     50

In [12]:
data_student.tail(3)

      Name  Grade
8     Mary     50
9     John     40
10  Joseph     30

In [13]:
data_student.to_csv('data_studentss.csv')